

// 资讯接口
// getData_5    	--获取系统时间
// getData_20280	--添加/修改/删除预警
// getData_20281	--查询用户预警信息
// getData_20282	--查询涨停板开启
// getData_20290	--条件单设置
// getData_20291	--条件单暂停、恢复
// getData_20292	--查询条件单信息
// getData_20293	--查询条件单详情
// getData_20294	--查询涨停板开启
// getData_20295	--查询已触发条件单触发详情
// getData_20296	--查询已触发条件单委托明细
// getData_41046	--获取收件箱资讯列表
// getData_41082	--查询交易日历
// getData_41091	--客户端埋点
// getData_41094	--获取组件权限
// getData_41500	--焦点图/查询所有快捷图标列表
// getData_44050	--获取验证码
// getData_46101	--获取资讯列表
// getData_46102	--获取资讯内容
// getData_46103	--A股(简况)
// getData_46106	--获取股市日历里面的数据
// getData_46118	--综合资讯列表
// getData_46119	--综合资讯内容
// getData_46127	--综合资讯实时滚动新闻
// getData_46141	--获取上市表现
// getData_46142	--获取已发行未上市数据
// getData_46143	--新股详情
// getData_46144	--新闻公告
// getData_46147	--新债未上市 上市表现
// getData_49050	--微信支付信息
// getData_49060	--新增订单
// getData_49064	--查询产品信息
// getData_49068	--查询订单
// getData_49095	--新增用户反馈
// getData_49096	--查询用户反馈
// getData_49131	--版本更新查询
// getData_49135	--获取userid
// getData_49137	--用户信息修改
// getData_49168	--支付宝支付信息
// getData_49190	--投顾接口
// getData_49226	--查询商城首页栏目和栏目下面的产品
// getData_49227	--查询栏目下面的产品
// getData_49228	--获取单个产品信息
// getData_49229	--取消关注
// getData_49230	--添加关注
// getData_49231	--分页查询我的关注列表
// getData_49232	--查询所有产品信息(智能选基)
// getData_49233	--搜索产品
// getData_49235	--热搜
// getData_49236	--查询客户签署协议记录
// getData_49238	--转发中焯接口
// getData_49239	--协议签署
// getData_49242	--日历列表
// getData_49244	--查询产品需要签署的协议列表
// getData_49331	--交易权限预约开通
// getData_49332	--定期理财列表筛选
// getData_49333	--分页查询我的足迹列表
// getData_49334	--清空我的足迹
// getData_49335	--理财特殊产品权限校验
// getData_49336	--新客专享产品购买记录
// getData_49337	--基金公司列表查询
// getData_49372	--撤单删除新客购买记录
// getData_49373	--根据方案编号获取配置信息
// getData_49375	--保存客户配置方案
// getData_49376	--获取客户配置方案
// getData_49378	--定投计算器
// getData_49379	--日历
// getData_49382	--更新发售提醒配置
// getData_49383	--查询发售提醒记录
// getData_49384	--订阅即将发售产品
// getData_49386	--查询用户制定的快捷图标列表
// getData_49387	--保存用户定制的快捷图标数据
// getData_49390	--获取用户搜索历史产品收藏状态
// getData_49394	--标记意见反馈已解决或者未解决
// getData_49395	--获取发售提醒配置
// getData_49406	--获取基金昨日收益
// getData_49407	--查询理财日历产品列表
// getData_49410	--获取委托中的确认日及收益或到账日列表
// getData_49431	--持续霸榜基金查询接口
// getData_49432	--梦想定投
// getData_49433	--聪明定投记录保存
// getData_49434	--查询对标指数列表
// getData_49435	--获取省市区列表
// getData_49437	--基金诊断次数记录
// getData_49438	--聪明定投记录获取
// getData_49462	--获取意见反馈未读数量
// getData_49463	--消息设置为已读
// getData_49506	--资讯接口转发
// getData_50006	--关键字资讯查询
// getData_50010	--A股质押比例统计
// getData_50011	--A股主要质押放构成统计
// getData_50012	--上市公司质押比例排名
// getData_50013	--行业数据
// getData_50014	--重要股东股权质押详情
// getData_50015	--重要股东股权质押最新质押公告
// getData_50016	--单股票股权质押详情_折线图
// getData_50017	--单股票重要股东累计质押统计
// getData_50018	--单股重要股东股权质押最新质押公告
// getData_50019	--单股重要股东股权质押详情_饼图
// getData_50022	--科创板追踪-申报状态
// getData_50023	--科创板追踪-企业列表
// getData_50024	--科创板追踪-企业详情
// getData_50025	--科创板追踪-地区申报排行
// getData_50026	--科创板追踪-申报企业指标统计
// getData_50028	--科创板追踪-创新分类
// getData_50029	--科创板追踪-资讯栏
// getData_50030	--科创板追踪-受理名单
// getData_50031	--科创板追踪-搜索科创板	
// getData_50199	--基金代码前后端转换
// getData_50200	--获取公告列表
// getData_50201	--获取公告内容
// getData_50210	--获取分红列表
// getData_50220	--获取基金经理列表
// getData_50221	--获取基金经理详情
// getData_50230	--获取基金评级
// getData_50235	--获取公司概况
// getData_50241	--获取招募合同
// getData_50245	--获取历史收益
// getData_50250	--获取历史详情折线图
// getData_50251	--历史净值详情
// getData_50255	--活期产品详情页面
// getData_50252	--业绩表现详情列表
// getData_50257	--公募基金详情页面
// getData_50258	--重仓股票
// getData_50259	--运作费率
// getData_50260	--理财资讯
// getData_50261	--基金公司大全
// getData_50262	--基金经理-列表页
// getData_50263	--基金公司-详情页
// getData_50264	--基金公司-二级页面
// getData_50266	--基金评级-列表页
// getData_50267	--热点选基-列表页
// getData_50268	--热点选基-热点详情
// getData_50269	--指数选基-列表页
// getData_50270	--指数选基-个股页
// getData_50275	--数据选基-连续5年正收益
// getData_50276	--数据选基-定投明星基金
// getData_50277	--数据选基-十年老牌优秀基金
// getData_50278	--数据选基-持续霸榜精选好基
// getData_50279	--数据选基-闲钱理财新选择
// getData_50280	--基金诊断
// getData_50300	--交易信息
// getData_50301	--最新增发
// getData_50302	--公司资料
// getData_50303	--股本股东
// getData_50304	--公司高管
// getData_50305	--分红融资
// getData_50320	--财务数据-主要指标
// getData_50321	--财务数据-利润表
// getData_50322	--财务数据-资产负债表
// getData_50323	--财务数据-现金流量表
// getData_50324	--主要指标-净利润
// getData_50325	--主要指标-营业收入
// getData_50326	--主要指标-每股净资产
// getData_50327	--主要指标-每股现金流
// getData_50328	--主要指标-毛利率
// getData_50329	--主要指标-每股收益
// getData_50330	--主要指标-每股公积金
// getData_50331	--主要指标-每股未分配
// getData_50332	--必读-大事提醒
// getData_50333	--财务数据-首页数据展示
// getData_50904	--避雷针首页
// getData_50905	--个股详情页
// getData_50910	--A股/自选股排雷
// getData_50911	--避雷踩雷榜
// getData_50987	--申购发行计划
// getData_50988	--询价发行计划
// getData_50989	--新股申购 => 查询列表
// getData_50990	--新债日历
// getData_50991	--新债上市表现
// getData_50992	--新债准备上市
// getData_50993	--新债详情
// getData_50994	--新债申购 => 查询列表
// getData_51101	--获取自选股列表
// getData_51600	--沪深历史涨跌股票
// getData_51601	--获取开户数量
// getData_51602	--获取市盈率和市净率
// getData_51603	--创新股票数接口
// getData_51604	--沪深涨跌分析
// getData_51607	--实时创新股票数接口
// getData_51608	--实时获取创新股票信息接口
// getData_51613	--诊大盘-涨跌统计
// getData_51614	--诊大盘-涨跌停走势
// getData_51618	--诊大盘-资金流向走势接口
// getData_51619	--诊大盘-成交均价走势
// getData_51620	--诊大盘-委买委卖走势
// getData_51621	--诊大盘-委买委卖排行榜
// getData_51625	--5日涨幅
// getData_51626	--涨停揭秘
// getData_51627	--涨跌及涨跌停趋势
// getData_51628	--市场数据估值
// getData_51629	--指数详情接口	
// getData_51630	--融资融券规模图标
// getData_51696kuaixunData	--涨跌及涨跌停趋势
// getData_51697	--市场数据估值
// getData_51698	--指数详情接口
// getData_51699	--融资融券规模图标
// getData_56102	--获取资讯内容
// getData_46143    --新股详情
// getData_48354    --资讯收藏
// getData_48361    --资讯西西号主题号修改
// getData_48368    --资讯西西号关注列表
// getData_48369    --资讯西西号主题选择确认
// getData_48511    --资讯观点详情页请求
// getData_48512    --自选新闻列表
// getData_48367    --我的关注列表
// getData_48366    --关注和取消关注推荐号	


define(function (require, exports, module) {
	// 公共请求发送
	function getData(sendData, success, error, other) {
		var config = {
			oSendData: sendData,
			isToken: false,
			isload: false,
			fnSuccess: function fnSuccess(data) {
				success && success(data);
			},
			oConfig: function oConfig(data) {
				if (!!error && typeof error === 'function') {
					error(data);
				} else {
					// alert('查询失败');
				}
			}
		};
		config.oSendData['ReqlinkType'] = 2;
		config = $.extend(config, other);
		$.getData(config);
	}

	var apiArr = [5, 20280, 20281, 20282, 20290, 20291, 20292, 48512, 48366, 20293, 20294, 20295, 20296, 41046, 41082, 41091, 41094, 41500, 44050, 48367, 46101, 48363, 46102, 46103, 46106, 48357, 46118, 46119, 46127, 46141, 46142, 46143, 46144, 46147, 48361, 48360, 48359, 48371, 48510, 48511, 48368, 48354, 49050, 48352, 49060, 49064, 49068, 48350, 48353, 49095, 49096, 48369, 49131, 49135, 49137, 49168, 49190, 49226, 49227, 49228, 49229, 49230, 49231, 49232, 49233, 49235, 49236, 49238, 49239, 49242, 49244, 49331, 49332, 49333, 49334, 49335, 49336, 49337, 49372, 49373, 49375, 49376, 49378, 49379, 49382, 49383, 49384, 49386, 49387, 49390, 49394, 49395, 49406, 49407, 49410, 49431, 49432, 49433, 49434, 49435, 49437, 49438, 49462, 49463, 49506, 50006, 50010, 50011, 50012, 50013, 50014, 50015, 50016, 50017, 50018, 50019, 50022, 50023, 50024, 50025, 50026, 50028, 50029, 50030, 50031, 50199, 50200, 50201, 50210, 50220, 50221, 50230, 50235, 50241, 50245, 50250, 50251, 50252, 50255, 50257, 50258, 50259, 50260, 50261, 50262, 50263, 50264, 50266, 50267, 50268, 50269, 50270, 50275, 50276, 50277, 50278, 50279, 50280, 50300, 50301, 50302, 50303, 50304, 50305, 50320, 50321, 50322, 50323, 50324, 50325, 50326, 50327, 50328, 50329, 50330, 50331, 50332, 50333, 50904, 50905, 50910, 50911, 50987, 50988, 50989, 50990, 50991, 50992, 50993, 50994, 50995, 50996, 51101, 51600, 51601, 51602, 51603, 51604, 51607, 51608, 51613, 51614, 51618, 51619, 51620, 51621, 51625, 51626, 51627, 51628, 51629, 51630, 51696, 51697, 51698, 51699, 56102, 46143, 49220, 49221, 49222, 48200, 48201, 48202, 48203, 48204, 48205, 48206, 48207, 48208, 48209, 48210, 48211, 48212, 48213, 48204, 48215, 48216, 48528, 48529, 48530, 48531, 48537, 48142, 48143, 48144, 48145];
	var apiObj = {};
	for (var i = 0; i < apiArr.length; i++) {
		var funcName = 'getData_' + apiArr[i];
		var func;
		(function (i) {
			func = function func(obj, success, error, other) {
				var sendData = $.extend({
					action: apiArr[i]
				}, obj);
				getData(sendData, success, error, other);
			};
			return func;
		})(i);
		apiObj[funcName] = func;
	}
	exports.getData = apiObj;
});