

// 交易接口
// getData_116		--资金信息查询
// getData_117		--普通交易持仓
// getData_122		--证券股东信息查询
// getData_123		--新股配号查询
// getData_149		--已开户基金账户信息查询
// getData_151		--获取最大可卖数量
// getData_153		--基金账户开户
// getData_154		--基金公司信息查询
// getData_187		--客户信息查询
// getData_349		--历史中签查询(普通)
// getData_382		--报价回购买入
// getData_384		--报价回购买入
// getData_386		--续作标记
// getData_387		--报价回购当日委托
// getData_388		--报价回购当日委托
// getData_686		--新股发行提醒
// getData_5013		--新股申购额度查询
// getData_5016		--新股当日委托申请查询
// getData_5035		--新股申购委托（普通）
// getData_5061		--证券代码信息查询
// getData_5065		--新股历史委托申请查询
// getData_5123		--客户权限信息查询
// getData_5125		--客户权限  电子签名约定书签署
// getData_5177		--新股申购当日中签查询
// getData_5204		--历史适当性管理答题记录查询
// getData_5205		--当日适当性管理答题记录查询
// getData_5210		--证券理财产品认购
// getData_5211		--证券理财产品申购
// getData_5212		--证券理财产品赎回
// getData_5228		--签署开户协议
// getData_5283		--可询价代码信息查询
// getData_5284		--已询价信息查询
// getData_5285		--已入围信息查询
// getData_5286		--未入围信息查询
// getData_5287		--可申购代码信息查询
// getData_5288		--已申购信息查询
// getData_5289		--已申购中签信息查询
// getData_5290		--已申购未中签信息查询
// getData_5291		--批量询价
// getData_5292		--批量申购
// getData_5293		--可询价代码信息查询（无密查询）
// getData_5294		--可申购代码信息查询（无密查询）
// getData_5296   --询价历史委托
// getData_5297   --申购历史委托
// getData_5602		--数字证书查询
// getData_5603		--产品电子协议查询
// getData_5600		--业务电子协议查询
// getData_5601		--协议预览
// getData_5604		--协议签署
// getData_5605		--电子协议签署流水查询
// getData_5606		--电子协议下载
// getData_5609		--数字证书用户查询
// getData_5610		--数字证书用户创建
// getData_5611		--数字证书登记
// getData_5612		--电子协议签署流水查询(历史)
// getData_6117		--证券理财客户签署电子协议查询
// getData_6119		--证券理财查询客户签约信息
// getData_6132		--信托产品预约认购
// getData_6133		--信托产品撤单
// getData_6134		--信托产品申购
// getData_6135		--信托产品赎回
// getData_6136		--信托账户签约
// getData_6137		--信托账号查询
// getData_6138		--信托产品份额查询 
// getData_6139		--信托产品委托查询
// getData_6141		--信托历史成交
// getData_6145		--信托电子合同签署
// getData_6149		--信托电子合同查询
// getData_6191		--客户与开放式基金适当性校验
// getData_6199		--股东权限开通
// getData_6202		--客户权限查询
// getData_6208		--沪伦通权限开通资产检查
// getData_6293		--投资者层级信息查询
// getData_6294		--受限投资者可交易代码查询
// getData_6325   --三板历史中签查询
// getData_6581		--客户业务协议签署
// getData_6582		--客户业务协议查询
// getData_6603		--新股申购已中签查询
// getData_6604		--新股申购未中签查询
// getData_6605		--新股申购申购待公布查询
// getData_6651		--要约申请
// getData_6653		--要约委托撤单
// getData_6654		--要约信息查询
// getData_6655		--要约解除
// getData_6659		--股转要约预受委托
// getData_6660		--股转要约预受解除
// getData_6661		--股转要约信息查询
// getData_6662		--股转要约预受股份性质查询
// getData_6663		--股转要约可撤委托查询
// getData_6664		--股转要约委托查询
// getData_6665		--要约可委托数量获取
// getData_6666		--委托撤单
// getData_6672		--普通当日盈亏综合查询
// getData_6796		--客户基本信息检验
// getData_6798		--产品适当性信息查询
// getData_6802		--客户适当性信息查询
// getData_6803		--产品适当性信息检查记录
// getData_6825		--客户协议确认书签署
// getData_6841		--可转债申购信息查询
// getData_6843		--可转债当日中签查询
// getData_6873		--理财历史成交查询-定投
// getData_6874		--理财历史成交查询-买入
// getData_6875		--理财历史成交查询-赎回
// getData_6876		--理财历史成交查询-分红
// getData_6877		--理财历史成交查询-其他
// getData_6878		--理财基金定投修改
// getData_6879		--理财基金定投取消
// getData_6884		--理财定投记录查询
// getData_6885		--理财当日委托查询
// getData_6887		--理财历史成交查询
// getData_6888		--理财修改分红
// getData_6889		--理财产品持仓查询
// getData_6891     --已开户基金账户信息查询
// getData_6894		--理财定投
// getData_6896		--理财撤单
// getData_6897		--理财产品购买信息查询
// getData_6979		--产品预约代码信息查询
// getData_6982		--产品预约赎回
// getData_6984		--产品预约撤单
// getData_6985		--产品预约委托查询
// getData_6993		--条件单查询持仓
// getData_7101		--融资融券新股申购额度查询
// getData_7102   --新股配号查询（两融）
// getData_7103   --历史中签查询（两融）
// getData_7104		--当日可申购新股(两融)
// getData_7107   --新股当日委托申请查询(两融)
// getData_7121		--新股申购委托（两融）
// getData_7122   --当日中签或代缴款查询(两融)
// getData_7123   --新股历史委托申请查询（两融）
// getData_51120	--账户分析：获取用户资产信息
// getData_51131	--账户分析：获取已清仓股票数据
// getData_51132	--账户分析：获取已清仓股票详情
// getData_51133	--账户分析：获取月度账单
// getData_51134	--账户分析：获取资产统计
// getData_51135	--账户分析：获取盈亏走势
// getData_51136	--账户分析：获取总资产走势
// getData_51137	--账户分析：我的账户-获取账单月份
// getData_6118	  --风险等级是否匹配
// getData_5634	  --是否双录
// getData_6009	  --专业投资者

define(function (require, exports, module) {
  // 公共请求发送
  function getData(sendData, success, error, other) {
    var config = {
      oSendData: sendData,
      isload: false,
      fnSuccess: function fnSuccess(data) {
        success && success(data);
      },
      oConfig: function oConfig(data) {
        if (!!error && typeof error === 'function') {
          error(data);
        } else {
          alert(data.ERRORMESSAGE);
        }
      }
    };
    config.oSendData['ReqlinkType'] = 1;
    config = $.extend(config, other);
    $.getData(config);
  }
  var apiArr = [48201, 41500, 5223, 116, 117, 122, 123, 149, 151, 153, 154, 187, 349, 380, 382, 384, 386, 387, 388, 389, 539, 686, 5013, 5016, 5035, 5061, 5065, 5104, 5123, 5125, 5177, 5204, 5205, 5210, 5211, 5212, 5228, 5282, 5283, 5284, 5285, 5286, 5287, 5288, 5289, 5290, 5291, 5292, 5293, 5294, 5296, 5297, 5602, 5603, 5600, 5601, 5604, 5605, 5606, 5609, 5610, 5611, 5612, 5806, 6117, 6119, 6132, 6133, 6134, 6135, 6136, 6137, 6138, 6139, 6141, 6145, 6149, 6191, 6199, 6202, 6208, 6293, 6294, 6325, 6559, 6581, 6582, 6603, 6604, 6605, 6651, 6653, 6654, 6655, 6659, 6660, 6661, 6662, 6663, 6664, 6665, 6666, 6672, 6735, 6796, 6798, 6797, 6802, 6803, 6825, 6841, 6843, 6873, 6874, 6875, 6876, 6877, 6878, 6879, 6884, 6885, 6887, 6888, 6889, 6891, 6894, 6896, 6897, 6979, 6982, 6984, 6985, 6993, 7101, 7102, 7103, 7104, 7107, 7121, 7122, 7123, 51120, 51131, 51132, 51133, 51134, 51135, 51136, 51137, 137, 5106, 5173, 5175, 20293, 20290, 20296, 20291, 20292, 50954, 50955, 50956, 50957, 6118, 5634, 6737, 6009, 48200, 48201, 48202, 48203, 48204, 48205, 48206, 48207, 48208, 48209, 48210, 48211, 48212, 48213, 48214, 48215, 48216, 48217, 48218, 48219, 5, 5665, 5669];
  var apiObj = {};
  for (var i = 0; i < apiArr.length; i++) {
    var funcName = 'getData_' + apiArr[i];
    var func;
    (function (i) {
      func = function func(obj, success, error, other) {
        var sendData = $.extend({
          action: apiArr[i]
        }, obj);
        getData(sendData, success, error, other);
      };
      return func;
    })(i);
    apiObj[funcName] = func;
  }
  exports.getData = apiObj;
});